# 5.데이터 확인

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

        이름    학교    키   국어  수학  영어  과학  사회          특기
지원번호
1번     kim  덕원여고  167   85  95  90  88  80      python
2번     hur  덕원여고  165   90  81  95  79  93        java
3번    park  덕원여고  180   70  73  89  60  91           c
4번    jung   화곡고  172   89  86  61  95  80           c
5번     lee  광영여고  176  100  91  70  86  94        java
6번    choi  덕원여고  161   61  40  80  54  79  javascript
7번     han   화곡고  159   50  80  86  75  81      python

## DataFrame 확인
DataFrame 세부정보 확인 - 계산 가능한 데이터에 대해 column 별로 데이터의 갯수, 평균, 표준편차, 최소/최대값 등의 정보를 보여줌

In [3]:
df.describe()

                키          국어         수학         영어         과학         사회
count    7.000000    7.000000   7.000000   7.000000   7.000000   7.000000
mean   168.571429   77.857143  78.000000  81.571429  76.714286  85.428571
std      7.764388   17.957622  18.275667  12.149858  15.007934   6.852181
min    159.000000   50.000000  40.000000  61.000000  54.000000  79.000000
25%    163.000000   65.500000  76.500000  75.000000  67.500000  80.000000
50%    167.000000   85.000000  81.000000  86.000000  79.000000  81.000000
75%    174.000000   89.500000  88.500000  89.500000  87.000000  92.000000
max    180.000000  100.000000  95.000000  95.000000  95.000000  94.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 1번 to 7번
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   학교      7 non-null      object
 2   키       7 non-null      int64
 3   국어      7 non-null      int64
 4   수학      7 non-null      int64
 5   영어      7 non-null      int64
 6   과학      7 non-null      int64
 7   사회      7 non-null      int64
 8   특기      7 non-null      object
dtypes: int64(6), object(3)
memory usage: 560.0+ bytes

In [8]:
#처음 n개의 데이터만 가져오기(default=5)
df.head(2)

       이름    학교    키  국어  수학  영어  과학  사회      특기
지원번호
1번    kim  덕원여고  167  85  95  90  88  80  python
2번    hur  덕원여고  165  90  81  95  79  93    java

In [9]:
#마지막 n개의 데이터만 가져오기(default=5)
df.tail(2)

        이름    학교    키  국어  수학  영어  과학  사회          특기
지원번호
6번    choi  덕원여고  161  61  40  80  54  79  javascript
7번     han   화곡고  159  50  80  86  75  81      python

In [10]:
#value의 값 가져오기
df.values

array([['kim', '덕원여고', 167, 85, 95, 90, 88, 80, 'python'],
       ['hur', '덕원여고', 165, 90, 81, 95, 79, 93, 'java'],
       ['park', '덕원여고', 180, 70, 73, 89, 60, 91, 'c'],
       ['jung', '화곡고', 172, 89, 86, 61, 95, 80, 'c'],
       ['lee', '광영여고', 176, 100, 91, 70, 86, 94, 'java'],
       ['choi', '덕원여고', 161, 61, 40, 80, 54, 79, 'javascript'],
       ['han', '화곡고', 159, 50, 80, 86, 75, 81, 'python']], dtype=object)

In [11]:
#index의 값 가져오기
df.index

Index(['1번', '2번', '3번', '4번', '5번', '6번', '7번'], dtype='object', name='지원번호')

In [12]:
#column의 값 확인하기
df.columns

Index(['이름', '학교', '키', '국어', '수학', '영어', '과학', '사회', '특기'], dtype='object')

In [13]:
#크기 확인하기 = (row, column)
df.shape

(7, 9)

## Series 확인

In [14]:
df['키'].describe

<bound method NDFrame.describe of 지원번호
1번    167
2번    165
3번    180
4번    172
5번    176
6번    161
7번    159
Name: 키, dtype: int64>

In [15]:
df['키'].min()

159

In [16]:
df['키'].max()

180

In [17]:
#큰 순서대로 n개 데이터 가져오기
df['키'].nlargest(3)

지원번호
3번    180
5번    176
4번    172
Name: 키, dtype: int64

In [18]:
df['키'].head()

지원번호
1번    167
2번    165
3번    180
4번    172
5번    176
Name: 키, dtype: int64

In [19]:
#유효한 데이터의 개수
df['키'].count()

7

In [22]:
#중복제거 데이터 가져오기
df['학교'].unique()

array(['덕원여고', '화곡고', '광영여고'], dtype=object)

In [24]:
#중복제거 데이터의 개수
df['학교'].nunique()

3